package HWClassesAndLoops;

public class Funcs {

    public void f1() {
        for(int i = 1; i <= 10; i++)
        /*
        משתנה i שווה ל-1.
        כל עוד i קטן או שווה ל-10, משתנה i תוסיף לעצמו עוד צעד אחד.
        בעזרת משתנה i נוכל לעבור על כל האפשרויות.
        1 קטן מ-10,
        פונקציה תתפיס כוכבית (*).
        2 קטן מ-10,
        פונקציה תתפיס כוכבית (*) נוספת, עד צעד העשירי (כולל) ואז הלולה תסתיים.
        */
            System.out.println("*");
    }

    public int f2(int x) {
        /*
        משתנה x לצורך דוגמא שווה ל-10.
         */
        int c = 0;
        for(int i = 0; i <= x; i++)
        /*
        משתנה i שווה ל-0,
        כל עוד i קטן או שווה למשתנה x (לדוגמא 10), משתנה i תוסיף לעצמו עוד צעד אחד.
        בעזרת משתנה i נוכל לעבור על כל האפשרויות.
        */
            if(i % 3 == 0)
        /*
        בתנאי ש-i מתחלקת ל-3 ללא שארית,
        משתנה c תוסיף לעצמו אחד.
        */
                c++;
        /*
        0 / 3,
        3 / 3,
        6 / 3,
        9 / 3.
        */
        return c;
        /*
        משתנה c תחזיר 4
        */
    }

    public int f3(int x) {
        /*
        משתנה x לצורך דוגמא שווה ל-4321.
         */
        int c = 0;
        while (x > 0) {
        /*
        כל עוד x גדול מ-0,
        יש לחלק x ב-10 ולהוסיף ניסיון חילוק למשתנה C.
        */
            x /= 10;
            c++;
        /*
        4321 / 10,
        432 / 10,
        43 / 10,
        4 / 10.
        */
        }
        return c;
        /*
        משתנה c תחזיר 4
        */
    }
}
